# Приложение
COLOR_ALIASES = {
    "белый":      (255, 255, 255),
    "красный":    (255, 0, 0),
    "оранжевый":  (255, 120, 0),
    "желтый":     (255, 255, 0),
    "жёлтый":     (255, 255, 0),
    "зеленый":    (0, 255, 0),
    "зелёный":    (0, 255, 0),
    "голубой":    (0, 191, 255),
    "синий":      (0, 0, 255),
    "фиолетовый": (255, 0, 255),
    "чёрный":     (0, 0, 0),
    "черный":     (0, 0, 0),
    "cool_blue":  (181, 239, 255)
}

# Окно
CAPTION = "Brownian Engine"
WIDTH   = 700
HEIGHT  = 600
ICON    = "icon.ico"
FILL    = COLOR_ALIASES["белый"]

# Физика
V      = 8
MASS   = 10
RADIUS = 15

# Частицы
COLOR = COLOR_ALIASES["черный"]
